const pic_name_data=[
	"瑶/花木兰/西施/镜/貂蝉-猫影/王昭君/貂蝉-金蝉子/马超/司马懿",
	"曜/李白-敏锐之力/云中君/阿轲-节奏热浪/蔡文姬/澜/李信/公孙离/裴擒虎",
	"小乔/大乔/孙策/后羿-如梦令/嫦娥-如梦令/李元芳/孙尚香-时之恋人/刘备-时之恋人/马可波罗-暗影游猎",
	"妲己-时之彼端/元歌/弈星-踏雪寻梅/小乔-缤纷独角兽/上官婉儿-天狼绘梦者/孙膑-妖精王/安琪拉-魔法小厨娘/百里守约-朱雀志/百里玄策-白虎志",
	"王昭君-凤凰于飞/李白-凤求凰/夏侯惇-乘风破浪/孙策-猫狗日记/大乔-猫狗日记/明世隐/露娜-紫霞仙子/芈月-白晶晶/孙悟空-至尊宝",
	"玄策-热力回旋/张良-缤纷绘卷/韩信/伽罗/大乔-伊势巫女/艾琳/橘右京-修罗/不知火舞-魅语/娜可露露-晚萤",
	"甄姬-游园惊梦/诸葛亮-星航指挥官/赵云-皇家上将/鲁班大师-乓乓大师/杨玉环-霓裳风华/妲己-女仆咖啡/西施-归墟梦演/小乔-音你心动/周瑜-音你心动",
	"瑶-时之祈愿/云中君-时之祈愿/嫦娥-拒霜思/夏洛特-永昼/西施-游龙清影/孙尚香-异界灵契/李信-一念神魔/公孙离-祈雪灵祝/沈梦溪-月团寄思"
];


const pic_background_count = 5;